name: "depth_map_train_test"


######################################
#### LOAD DATA: 2 training images ####
######################################
layer {
  name: "LTrain_data"
  type: "Data"
  top: "L_data"
  top: "L_junk_label"
  include {
    phase: TRAIN
  }
  transform_param {
  }
  data_param {
    source: "lmdb_files/depth_train_L_lmdb"
    batch_size: 10
    backend: LMDB
  }
}
layer {
  name: "GTTrain_data"
  type: "Data"
  top: "GT_data"
  top: "GT_junk_label"
  include {
    phase: TRAIN
  }
  transform_param {
  }
  data_param {
    source: "lmdb_files/depth_train_GT_lmdb"
    batch_size: 10
    backend: LMDB
  }
}


######################################
#### LOAD DATA: 3 testing images  ####
######################################
layer {
  name: "LTest_data"
  type: "Data"
  top: "L_data"
  top: "L_junk_label"
  include {
    phase: TEST
  }
  transform_param {
  }
  data_param {
    source: "lmdb_files/depth_test_L_lmdb"
    batch_size: 10
    backend: LMDB
  }
}
layer {
  name: "GTTest_data"
  type: "Data"
  top: "GT_data"
  top: "GT_junk_label"
  include {
    phase: TEST
  }
  transform_param {
  }
  data_param {
    source: "lmdb_files/depth_test_GT_lmdb"
    batch_size: 10
    backend: LMDB
  }
}


######################################
#### SILENCE OUTPUT: fake labels  ####
######################################
layer {
  name: "stfu_L"
  type: "Silence"
  bottom: "L_junk_label"
}
layer {
  name: "stfu_GT"
  type: "Silence"
  bottom: "GT_junk_label"
}


######################################
#### PROCESS: left leg            ####
######################################

layer {
  name: "conv1_L"
  type: "Convolution"
  bottom: "L_data"
  top: "conv1_L"
  param {
    name: "conv1_w"
    lr_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 8
    kernel_size: 11
    pad: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_L"
  type: "ReLU"
  bottom: "conv1_L"
  top: "conv1_L"
}
layer {
  name: "norm1_L"
  type: "LRN"
  bottom: "conv1_L"
  top: "conv1_L"
  lrn_param {
    local_size: 5
    alpha: 0.25
    beta: 0.75
    norm_region: WITHIN_CHANNEL
  }
}
#layer {
#  name: "conv1_L"
#  type: "Convolution"
#  bottom: "L_data"
#  top: "conv1_L"
#  param {
#    name: "conv1_w"
#    lr_mult: 1
#  }
#  param {
#    name: "conv1_b"
#    lr_mult: 2
#  }
#  convolution_param {
#    num_output: 8
#    kernel_size: 11
#    pad: 5
#    stride: 1
#    weight_filler {
#      type: "xavier"
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#}
#layer {
#  name: "relu1_L"
#  type: "ReLU"
#  bottom: "conv1_L"
#  top: "conv1_L"
#}
#layer {
#  name: "norm1_L"
#  type: "LRN"
#  bottom: "conv1_L"
#  top: "conv1_L"
#  lrn_param {
#    local_size: 5
#    alpha: 0.25
#    beta: 0.75
#    norm_region: WITHIN_CHANNEL
#  }
#}
layer {
  name: "pool1_L"
  type: "Pooling"
  bottom: "conv1_L"
  top: "pool1_L"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2_L"
  type: "Convolution"
  bottom: "pool1_L"
  top: "conv2_L"
  param {
    name: "conv2_w"
    lr_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_L"
  type: "ReLU"
  bottom: "conv2_L"
  top: "conv2_L"
}
layer {
  name: "norm2_L"
  type: "LRN"
  bottom: "conv2_L"
  top: "conv2_L"
  lrn_param {
    local_size: 5
    alpha: 0.25
    beta: 0.75
    norm_region: WITHIN_CHANNEL
  }
}

layer {
  name: "conv3_L"
  type: "Convolution"
  bottom: "conv2_L"
  top: "conv3_L"
  param {
    name: "conv3_w"
    lr_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_L"
  type: "ReLU"
  bottom: "conv3_L"
  top: "conv3_L"
}
layer {
  name: "norm3_L"
  type: "LRN"
  bottom: "conv3_L"
  top: "conv3_L"
  lrn_param {
    local_size: 5
    alpha: 0.25
    beta: 0.75
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "conv3b_L"
  type: "Convolution"
  bottom: "conv3_L"
  top: "conv3b_L"
  param {
    name: "conv3b_w"
    lr_mult: 1
  }
  param {
    name: "conv3b_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3b_L"
  type: "ReLU"
  bottom: "conv3b_L"
  top: "conv3b_L"
}
layer {
  name: "norm3b_L"
  type: "LRN"
  bottom: "conv3b_L"
  top: "conv3b_L"
  lrn_param {
    local_size: 5
    alpha: 0.25
    beta: 0.75
    norm_region: WITHIN_CHANNEL
  }
}
layer {
  name: "pool3_L"
  type: "Pooling"
  bottom: "conv3b_L"
  top: "pool3_L"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv4_L"
  type: "Convolution"
  bottom: "pool3_L"
  top: "conv4_L"
  param {
    name: "conv4_w"
    lr_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    pad: 2
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_L"
  type: "ReLU"
  bottom: "conv4_L"
  top: "conv4_L"
}
layer {
  name: "norm4_L"
  type: "LRN"
  bottom: "conv4_L"
  top: "conv4_L"
  lrn_param {
    local_size: 5
    alpha: 0.25
    beta: 0.75
    norm_region: WITHIN_CHANNEL
  }
}


######################################
#### PROCESS: Fully Connect       ####
######################################
layer {
  name: "fc5"
  type: "InnerProduct"
  bottom: "conv4_L"
  top: "fc5"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_F"
  type: "ReLU"
  bottom: "fc5"
  top: "fc5"
}
layer {
  name: "drop5_F"
  type: "Dropout"
  bottom: "fc5"
  top: "fc5"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "fc5"
  top: "fc6"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_F"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6_F"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}





######################################
#### PROCESS: Upsample            ####
######################################
layer {
  name: "join_InnerProduct"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fcUp"
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "make2d"
  type: "Reshape"
  bottom: "fcUp"
  top: "reshaped"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 32
      dim: 64
    }
  }
}
layer {
  name: "upsample"
  type: "Deconvolution"
  bottom: "reshaped"
  top: "upsamp"
  convolution_param{
    kernel_size: 4
    stride: 2
    num_output: 1
    group: 1
    pad: 1
    weight_filler: {
      type: "bilinear"
    }
    bias_term: false
  }
  param {
     lr_mult: 0
    decay_mult: 0
  }
}


######################################
#### PROCESS: calculate loss      ####
######################################
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "upsamp"
  bottom: "GT_data"
  top: "upsampled_loss"
}



######################################
#### STEP 5 alt: downsample GT    ####
####    out: 32 x 64 x 1          ####
######################################
layer {
  name: "pool1_GT"
  type: "Pooling"
  bottom: "GT_data"
  top: "pool1_GT"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


######################################
#### STEP 6 alt: loss             ####
####    out: 1                    ####
######################################
layer {
  name: "loss_alt"
  type: "EuclideanLoss"
  bottom: "reshaped"
  bottom: "pool1_GT"
  top: "loss"
}